W8D1/app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)
    @post.user_id = params[:user_id]
    @post.sub_id = params[:hidden][:sub_id]
    if @post.save
---
INSERT INTO "posts" ("title", "url", "content", "sub_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["title", "J"], ["url", "cool"], ["content", "hi"], ["sub_id", 1], ["user_id", 1], ["created_at", "2019-10-07 23:54:38.065641"], ["updated_at", "2019-10-07 23:54:38.065641"]]