W11D4/app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "OWRBQ978jTSK9SywulSLmg"], ["updated_at", "2019-10-30 22:20:00.293346"], ["id", 2]]
---
  def reset_token!
    self.session_token = SecureRandom.urlsafe_base64(16)
    self.save!