W7D2/app/models/user.rb

UPDATE "users" SET "updated_at" = $1, "session_token" = $2 WHERE "users"."id" = $3  [["updated_at", "2019-10-01 23:33:48.561422"], ["session_token", "zH8naoNevX_YliUFChJT2w"], ["id", 2]]
---
  def reset_session_token!
    self.update!(session_token: User.generate_session_token)