W6D5/cats/app/controllers/cats_controller.rb

  def update
    @cat = Cat.find(params[:id])

    if @cat.update(cat_params)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "cats" SET "color" = $1, "updated_at" = $2 WHERE "cats"."id" = $3  [["color", "Green"], ["updated_at", "2019-09-27 23:57:06.543166"], ["id", 1]]